# -*- coding: utf-8 -*-
from d1 import E, add
add("見風使舵","ㄐㄧㄢˋ ㄈㄥ ㄕˇ ㄉㄨㄛˋ","比喻見機行事。","這件事你就見風使舵，看著辦吧！","隨機應變","一意孤行　刻舟求劍",[("歇後語","撐船的老闆——見風使舵")])
add("乘龍快婿","ㄔㄥˊ ㄌㄨㄥˊ ㄎㄨㄞˋ ㄒㄩˋ","比喻令人滿意的女婿。","姑丈對長輩恭敬孝順，是奶奶眼中的乘龍快婿。","東床坦腹","",[("典故","春秋時代，秦穆公有個漂亮又善於吹笙的女兒名叫弄玉。有天夜裡弄玉夢見一位男子對著她吹奏赤玉簫，音調令人陶醉。第二天，她趕緊請穆公派人去找。後來在太華山找到一個叫蕭史的人，他所吹奏的簫聲和弄玉在夢中的一模一樣，於是穆公便把女兒嫁給他。某夜蕭史與弄玉合奏時，天上突然降下金龍紫鳳，夫乘龍，婦乘鳳，二人雙雙翔雲而去。")])
add("家徒四壁","ㄐㄧㄚ ㄊㄨˊ ㄙˋ ㄅㄧˋ","比喻家境清苦，一無所有。","為了照顧身心障礙的兒子，他們已面臨家徒四壁的窘境。","身無長物　一貧如洗","萬貫家財　金玉滿堂",[("辨析","「家徒四壁」與「一貧如洗」皆可形容家境貧苦不富裕。但前者較偏向形容居所的簡陋，兩者略有不同。")])
add("首如飛蓬","ㄕㄡˇ ㄖㄨˊ ㄈㄟ ㄆㄥˊ","頭髮散亂像飛散的蓬草，比喻無心化妝打扮。","他為了這場設計比賽已數日未眠，故精神委靡，首如飛蓬。","披頭散髮　蓬頭垢面","一絲不亂")
