# -*- coding: utf-8 -*-
from d2 import E, add
add("略見一斑","ㄌㄩㄝˋ ㄐㄧㄢˋ ㄧˋ ㄅㄢ","比喻由部分可推知整體。","現代人審美觀念的膚淺，從整容中心四處林立，可略見一斑。","略知一二","一無所知")
add("海底撈針","ㄏㄞˇ ㄉㄧˇ ㄌㄠ ㄓㄣ","比喻白費力氣，希望渺茫，不可能的事。","要在茫茫人海中，找到她失散的孩子，簡直是海底撈針。","水中撈月","手到擒來　探囊取物",[("辨析","「海底撈針」與「水中撈月」皆有目標難以達成的意思，但後者的語意更強烈，指事情根本不可能實現。")])
add("班門弄斧","ㄅㄢ ㄇㄣˊ ㄋㄨㄥˋ ㄈㄨˇ","班，魯班，古代巧匠。在魯班門前揮動斧頭。比喻在行家面前賣弄本領，有自不量力的意思。","那點三腳貓功夫，竟敢在高手面前班門弄斧，真是可笑！","布鼓雷門　蚍蜉撼樹","量力而行　深藏不露",[("辨析","「螳臂擋車」和「班門弄斧」皆具有自不量力的意思，但是「班門弄斧」偏重於賣弄本領的意思，兩者稍有不同。"),("歇後語","班門弄斧——假充內行")])
add("削足適履","ㄒㄩㄝ ㄗㄨˊ ㄕˋ ㄌㄩˇ","形容勉強求合，生搬硬套，而不顧及實際的狀況。","做任何事都必須權衡狀況，不可削足適履。","刻舟求劍　膠柱鼓瑟","通權達變　守經達權")
add("脣亡齒寒","ㄔㄨㄣˊ ㄨㄤˊ ㄔˇ ㄏㄢˊ","比喻雙方關係密切，失去一方，另一方也會受到損害。","所謂脣亡齒寒，一旦國家滅亡，個人和家庭還能存在嗎？","輔車相依　脣齒相依","風馬不接　各自為政",[("俗諺","覆巢之下無完卵")])
add("眾望所歸","ㄓㄨㄥˋ ㄨㄤˋ ㄙㄨㄛˇ ㄍㄨㄟ","形容人威望高，受到群眾的敬仰、支持。","他這次能獲選為模範生實在是眾望所歸。","人心所向　天與人歸","千夫所指　眾叛親離")
add("雪中送炭","ㄒㄩㄝˇ ㄓㄨㄥ ㄙㄨㄥˋ ㄊㄢˋ","比喻在別人困難和急需時，及時給予物質上的幫助。","聽到慈善機構資金不足的窘境，他立刻雪中送炭。","慷慨解囊　急人之難","乘人之危　趁火打劫",[("辨析","「雪中送炭」和「雪上加霜」是完全不同的意思，後者是形容災禍接連而來。")])
add("雪泥鴻爪","ㄒㄩㄝˇ ㄋㄧˊ ㄏㄨㄥˊ ㄓㄠˇ","比喻往事留下的痕跡。","在那些詩詞中，我們彷彿可以發現唐朝盛世的雪泥鴻爪。","","",[("俗諺","凡走過必留下痕跡")])
add("火樹銀花","ㄏㄨㄛˇ ㄕㄨˋ ㄧㄣˊ ㄏㄨㄚ","形容燈火通明燦爛的景象。","每年元宵燈節，各地燈會火樹銀花，好不熱鬧。","燈火輝煌　張燈結彩","燈火闌珊　黑漆一團")
